In [2]:
# root:root → username:password
# localhost → server
# retail_store → database/schema

%reload_ext sql
%sql mysql+mysqlconnector://root:root@localhost/library_management

In [3]:
%%sql

USE library_management

 * mysql+mysqlconnector://root:***@localhost/library_management
0 rows affected.

[]

In [20]:
%%sql

SHOW tables;

 * mysql+mysqlconnector://root:***@localhost/library_management
8 rows affected.

[('book_issued_count',),
 ('books',),
 ('branch',),
 ('employees',),
 ('expensive_books',),
 ('issued_status',),
 ('members',),
 ('return_status',)]

**CRUD OPERATION**

In [5]:
%%sql

# 1.CREATE NEW RECORD

INSERT INTO books(isbn, book_title, category, rental_price, status, author, publisher)
VALUES('978-0-7432-7356-5', 'The Great Gatsby', 'Classic', 5.75, 'yes', 'F. Scott Fitzgerald', 'Charles Scribner\'s Sons');

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[]

In [6]:
%%sql
# 2. UPDATE A RECORD
UPDATE members
SET member_address = '125 Oak St'
WHERE member_id = 'C103';

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[]

In [7]:
%%sql
# 3. DELETE A RECORD F
DELETE FROM books
where isbn='978-0-7432-7356-5'

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[]

In [9]:
%%sql
# 4. RETRIEVE RECORD
SELECT * FROM members

 * mysql+mysqlconnector://root:***@localhost/library_management
12 rows affected.

[('C101', 'Alice Johnson', '123 Main St', '2021-05-15'),
 ('C102', 'Bob Smith', '456 Elm St', '2021-06-20'),
 ('C103', 'Carol Davis', '125 Oak St', '2021-07-10'),
 ('C104', 'Dave Wilson', '567 Pine St', '2021-08-05'),
 ('C105', 'Eve Brown', '890 Maple St', '2021-09-25'),
 ('C106', 'Frank Thomas', '234 Cedar St', '2021-10-15'),
 ('C107', 'Grace Taylor', '345 Walnut St', '2021-11-20'),
 ('C108', 'Henry Anderson', '456 Birch St', '2021-12-10'),
 ('C109', 'Ivy Martinez', '567 Oak St', '2022-01-05'),
 ('C110', 'Jack Wilson', '678 Pine St', '2022-02-25'),
 ('C118', 'Sam', '133 Pine St', '2024-06-01'),
 ('C119', 'John', '143 Main St', '2024-05-01')]

**CTAS**

**Create Summary Tables: Used CTAS to generate new tables based on query results - each book and total book_issued_cnt**

In [11]:
%%sql

SELECT * FROM books
limit 5

 * mysql+mysqlconnector://root:***@localhost/library_management
5 rows affected.

[('978-0-06-025492-6', 'Where the Wild Things Are', 'Children', Decimal('3.50'), 'yes', 'Maurice Sendak', 'HarperCollins'),
 ('978-0-06-112008-4', 'To Kill a Mockingbird', 'Classic', Decimal('5.00'), 'yes', 'Harper Lee', 'J.B. Lippincott & Co.'),
 ('978-0-06-112241-5', 'The Kite Runner', 'Fiction', Decimal('5.50'), 'yes', 'Khaled Hosseini', 'Riverhead Books'),
 ('978-0-06-440055-8', "Charlotte's Web", 'Children', Decimal('4.00'), 'yes', 'E.B. White', 'Harper & Row'),
 ('978-0-09-957807-9', 'A Game of Thrones', 'Fantasy', Decimal('7.50'), 'yes', 'George R.R. Martin', 'Bantam')]

In [13]:
%%sql

select * from issued_status
limit 5

 * mysql+mysqlconnector://root:***@localhost/library_management
5 rows affected.

[('IS106', 'C106', '978-0-330-25864-8', datetime.date(2024, 3, 10), 'E104', 'Animal Farm'),
 ('IS107', 'C107', '978-0-14-118776-1', datetime.date(2024, 3, 11), 'E104', 'One Hundred Years of Solitude'),
 ('IS108', 'C108', '978-0-525-47535-5', datetime.date(2024, 3, 12), 'E104', 'The Great Gatsby'),
 ('IS109', 'C109', '978-0-141-44171-6', datetime.date(2024, 3, 13), 'E105', 'Jane Eyre'),
 ('IS110', 'C110', '978-0-307-37840-1', datetime.date(2024, 3, 14), 'E105', 'The Alchemist')]

In [19]:
%%sql

CREATE TABLE book_issued_count as
SELECT b.isbn,b.book_title,count(*) as TOTAL_BOOK_ISSUED
FROM books b
INNER JOIN issued_status i
ON b.isbn=i.issued_book_isbn
GROUP BY b.isbn,b.book_title

 * mysql+mysqlconnector://root:***@localhost/library_management
29 rows affected.

[]

In [20]:
%%sql

SHOW TABLES

 * mysql+mysqlconnector://root:***@localhost/library_management
7 rows affected.

[('book_issued_count',),
 ('books',),
 ('branch',),
 ('employees',),
 ('issued_status',),
 ('members',),
 ('return_status',)]

**Data Analysis & Findings**

**1.Retrieve All Books based on Category**

In [30]:
%%sql

SELECT 
    CATEGORY,
    GROUP_CONCAT(book_title SEPARATOR ', ') AS BOOK_LIST
FROM books
GROUP BY category
ORDER BY category;

 * mysql+mysqlconnector://root:***@localhost/library_management
11 rows affected.

[('Children', "Where the Wild Things Are, Charlotte's Web"),
 ('Classic', 'To Kill a Mockingbird, A Tale of Two Cities, Pride and Prejudice, Jane Eyre, Animal Farm, Moby Dick, The Great Gatsby, The Catcher in the Rye'),
 ('Dystopian', 'Fahrenheit 451, The Road, Brave New World, 1984, The Road, 1984'),
 ('Fantasy', 'A Game of Thrones, Harry Potter and the Sorcerers Stone, The Hobbit'),
 ('Fiction', 'The Kite Runner, The Alchemist, Beloved'),
 ('History', 'The Histories, The Guns of August, Sapiens: A Brief History of Humankind, A Peoples History of the United States, The Diary of a Young Girl'),
 ('Horror', 'The Shining, The Stand'),
 ('Literary Fiction', 'One Hundred Years of Solitude'),
 ('Mystery', 'The Da Vinci Code, Angels & Demons'),
 ('Romance', 'Pride and Prejudice'),
 ('Science Fiction', 'Dune')]

**2.Find Total Rental Income by Category**

In [42]:
%%sql

SELECT b.category,count(*) as TOTAL_BOOKS,SUM(b.rental_price) as TOTAL_RENTAL_INCOME
FROM books b
INNER JOIN issued_status i
ON b.isbn=i.issued_book_isbn
GROUP BY b.category

 * mysql+mysqlconnector://root:***@localhost/library_management
10 rows affected.

[('Children', 2, Decimal('7.50')),
 ('Classic', 10, Decimal('59.00')),
 ('Fiction', 3, Decimal('14.50')),
 ('Fantasy', 4, Decimal('28.50')),
 ('History', 5, Decimal('36.00')),
 ('Literary Fiction', 1, Decimal('6.50')),
 ('Science Fiction', 1, Decimal('8.50')),
 ('Dystopian', 4, Decimal('25.50')),
 ('Mystery', 1, Decimal('7.50')),
 ('Horror', 1, Decimal('7.00'))]

**3. List Members Who Registered in the after 2024**

In [37]:
%%sql

SELECT member_id,member_name
FROM members
where YEAR(reg_date)>=2024

 * mysql+mysqlconnector://root:***@localhost/library_management
2 rows affected.

[('C118', 'Sam'), ('C119', 'John')]

**4.List Employees with Their Branch Manager's Name and their branch details**

In [6]:
%%sql

SELECT 
    e1.emp_id,e1.emp_name,e1.position,
    e2.emp_name as manager_name,b1.*
FROM employees e1
INNER JOIN branch b1
ON e1.branch_id=b1.branch_id
INNER JOIN employees e2
ON e2.emp_id=b1.manager_id

 * mysql+mysqlconnector://root:***@localhost/library_management
11 rows affected.

[('E101', 'John Doe', 'Clerk', 'Daniel Anderson', 'B001', 'E109', '123 Main St', '+919099988676'),
 ('E103', 'Mike Johnson', 'Librarian', 'Daniel Anderson', 'B001', 'E109', '123 Main St', '+919099988676'),
 ('E104', 'Emily Davis', 'Assistant', 'Daniel Anderson', 'B001', 'E109', '123 Main St', '+919099988676'),
 ('E105', 'Sarah Brown', 'Assistant', 'Daniel Anderson', 'B001', 'E109', '123 Main St', '+919099988676'),
 ('E106', 'Michelle Ramirez', 'Assistant', 'Daniel Anderson', 'B001', 'E109', '123 Main St', '+919099988676'),
 ('E102', 'Jane Smith', 'Clerk', 'Daniel Anderson', 'B002', 'E109', '456 Elm St', '+919099988677'),
 ('E109', 'Daniel Anderson', 'Manager', 'Daniel Anderson', 'B003', 'E109', '789 Oak St', '+919099988678'),
 ('E108', 'Jessica Taylor', 'Clerk', 'Laura Martinez', 'B004', 'E110', '567 Pine St', '+919099988679'),
 ('E107', 'Michael Thompson', 'Clerk', 'Laura Martinez', 'B005', 'E110', '890 Maple St', '+919099988680'),
 ('E110', 'Laura Martinez', 'Manager', 'Laura Martinez', 'B005', 'E110', '890 Maple St', '+919099988680'),
 ('E111', 'Christopher Lee', 'Assistant', 'Laura Martinez', 'B005', 'E110', '890 Maple St', '+919099988680')]

**5.Create a Table of Books with Rental Price Above a Certain Threshold**

In [13]:
%%sql

CREATE TABLE expensive_books AS
SELECT * FROM books
WHERE rental_price>=7

 * mysql+mysqlconnector://root:***@localhost/library_management
14 rows affected.

[]

**6.Retrieve the List of Books Not Yet Returned**

In [17]:
%%sql

SELECT i.issued_book_name as NOT_RETURNED_BOOKS
FROM issued_status i
LEFT JOIN return_status r
ON i.issued_id=r.issued_id
where r.issued_id is null

 * mysql+mysqlconnector://root:***@localhost/library_management
18 rows affected.

[('Fahrenheit 451',),
 ('Dune',),
 ('Where the Wild Things Are',),
 ('The Kite Runner',),
 ("Charlotte's Web",),
 ('Beloved',),
 ('A Tale of Two Cities',),
 ('The Stand',),
 ('Moby Dick',),
 ('To Kill a Mockingbird',),
 ('The Hobbit',),
 ('Angels & Demons',),
 ('The Diary of a Young Girl',),
 ('Sapiens: A Brief History of Humankind',),
 ('The Catcher in the Rye',),
 ('The Great Gatsby',),
 ('Harry Potter and the Sorcerers Stone',),
 ('Animal Farm',)]

**7.Write a query to identify members who have overdue books (assume a 30-day return period). Display the member's name, book title, issue date, and days overdue.**

In [12]:
%%sql
WITH overdue_books AS (
    SELECT 
        i.issued_id,
        i.issued_book_isbn,
        i.issued_date,
        i.issued_member_id,
        b.book_title,
        r.return_date,
        DATEDIFF(COALESCE(r.return_date,CURDATE()), i.issued_date) AS no_of_days
    FROM issued_status i
    JOIN books b 
        ON i.issued_book_isbn = b.isbn
    LEFT JOIN return_status r 
        ON i.issued_id = r.issued_id
)
SELECT 
    ob.issued_member_id,
    m.member_name,
    ob.book_title,
    ob.issued_date,
    ob.no_of_days AS days_overdue,
    CASE 
        WHEN return_date is not null then 'Returned' else 'Not Returned' END AS status_of_book
FROM overdue_books ob
JOIN members m 
    ON ob.issued_member_id = m.member_id
WHERE no_of_days>30
ORDER BY status_of_book,ob.issued_member_id

 * mysql+mysqlconnector://root:***@localhost/library_management
32 rows affected.

[('C102', 'Bob Smith', 'Fahrenheit 451', datetime.date(2024, 3, 26), 536, 'Not Returned'),
 ('C103', 'Carol Davis', 'Dune', datetime.date(2024, 3, 27), 535, 'Not Returned'),
 ('C104', 'Dave Wilson', 'Where the Wild Things Are', datetime.date(2024, 3, 28), 534, 'Not Returned'),
 ('C105', 'Eve Brown', 'The Kite Runner', datetime.date(2024, 3, 29), 533, 'Not Returned'),
 ('C105', 'Eve Brown', "Charlotte's Web", datetime.date(2024, 3, 30), 532, 'Not Returned'),
 ('C105', 'Eve Brown', 'Beloved', datetime.date(2024, 3, 31), 531, 'Not Returned'),
 ('C105', 'Eve Brown', 'A Tale of Two Cities', datetime.date(2024, 4, 1), 530, 'Not Returned'),
 ('C105', 'Eve Brown', 'The Stand', datetime.date(2024, 4, 2), 529, 'Not Returned'),
 ('C106', 'Frank Thomas', 'Moby Dick', datetime.date(2024, 4, 3), 528, 'Not Returned'),
 ('C106', 'Frank Thomas', 'To Kill a Mockingbird', datetime.date(2024, 4, 4), 527, 'Not Returned'),
 ('C106', 'Frank Thomas', 'The Hobbit', datetime.date(2024, 4, 5), 526, 'Not Returned'),
 ('C107', 'Grace Taylor', 'Angels & Demons', datetime.date(2024, 4, 6), 525, 'Not Returned'),
 ('C107', 'Grace Taylor', 'The Diary of a Young Girl', datetime.date(2024, 4, 7), 524, 'Not Returned'),
 ('C107', 'Grace Taylor', 'Sapiens: A Brief History of Humankind', datetime.date(2024, 4, 8), 523, 'Not Returned'),
 ('C107', 'Grace Taylor', 'The Catcher in the Rye', datetime.date(2024, 4, 10), 521, 'Not Returned'),
 ('C108', 'Henry Anderson', 'The Great Gatsby', datetime.date(2024, 4, 11), 520, 'Not Returned'),
 ('C109', 'Ivy Martinez', 'Harry Potter and the Sorcerers Stone', datetime.date(2024, 4, 12), 519, 'Not Returned'),
 ('C110', 'Jack Wilson', 'Animal Farm', datetime.date(2024, 4, 13), 518, 'Not Returned'),
 ('C101', 'Alice Johnson', 'Pride and Prejudice', datetime.date(2024, 3, 22), 64, 'Returned'),
 ('C106', 'Frank Thomas', 'Animal Farm', datetime.date(2024, 3, 10), 52, 'Returned'),
 ('C107', 'Grace Taylor', 'One Hundred Years of Solitude', datetime.date(2024, 3, 11), 53, 'Returned'),
 ('C108', 'Henry Anderson', 'The Great Gatsby', datetime.date(2024, 3, 12), 54, 'Returned'),
 ('C109', 'Ivy Martinez', 'Jane Eyre', datetime.date(2024, 3, 13), 55, 'Returned'),
 ('C109', 'Ivy Martinez', 'Harry Potter and the Sorcerers Stone', datetime.date(2024, 3, 15), 57, 'Returned'),
 ('C109', 'Ivy Martinez', 'A Game of Thrones', datetime.date(2024, 3, 16), 58, 'Returned'),
 ('C109', 'Ivy Martinez', 'A Peoples History of the United States', datetime.date(2024, 3, 17), 59, 'Returned'),
 ('C109', 'Ivy Martinez', 'The Guns of August', datetime.date(2024, 3, 18), 60, 'Returned'),
 ('C109', 'Ivy Martinez', 'The Histories', datetime.date(2024, 3, 19), 61, 'Returned'),
 ('C110', 'Jack Wilson', 'The Alchemist', datetime.date(2024, 3, 14), 56, 'Returned'),
 ('C110', 'Jack Wilson', '1984', datetime.date(2024, 3, 21), 63, 'Returned'),
 ('C110', 'Jack Wilson', 'Brave New World', datetime.date(2024, 3, 23), 65, 'Returned'),
 ('C110', 'Jack Wilson', 'The Road', datetime.date(2024, 3, 24), 66, 'Returned')]

**8. Write a query to update the status of books in the books table to "Yes" when they are returned (based on entries in the return_status table).**

In [37]:
%%sql

UPDATE books
SET status='no'
WHERE isbn='978-0-06-112008-4'

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[]

In [38]:
%%sql

select * from books
limit 5

 * mysql+mysqlconnector://root:***@localhost/library_management
5 rows affected.

[('978-0-06-025492-6', 'Where the Wild Things Are', 'Children', Decimal('3.50'), 'yes', 'Maurice Sendak', 'HarperCollins'),
 ('978-0-06-112008-4', 'To Kill a Mockingbird', 'Classic', Decimal('5.00'), 'no', 'Harper Lee', 'J.B. Lippincott & Co.'),
 ('978-0-06-112241-5', 'The Kite Runner', 'Fiction', Decimal('5.50'), 'yes', 'Khaled Hosseini', 'Riverhead Books'),
 ('978-0-06-440055-8', "Charlotte's Web", 'Children', Decimal('4.00'), 'yes', 'E.B. White', 'Harper & Row'),
 ('978-0-09-957807-9', 'A Game of Thrones', 'Fantasy', Decimal('7.50'), 'yes', 'George R.R. Martin', 'Bantam')]

In [ ]:
%%sql

DELIMITER $$
DROP PROCEDURE IF EXISTS add_return_records $$

CREATE PROCEDURE add_return_records(
    IN new_return_id VARCHAR(6),
    IN o_issued_id VARCHAR(6)
)
BEGIN
    DECLARE v_isbn VARCHAR(50);
    DECLARE v_book_name VARCHAR(80);

    -- Insert into return_status
    INSERT INTO return_status(return_id, issued_id, return_date)
    VALUES(new_return_id, o_issued_id, CURRENT_DATE);

    -- Get book details
    SELECT issued_book_isbn, issued_book_name
    INTO v_isbn, v_book_name
    FROM issued_status
    WHERE issued_id = o_issued_id;

    -- Update book availability
    UPDATE books
    SET status = 'yes'
    WHERE isbn = v_isbn;

    -- Return message
    SELECT CONCAT('Thank you for returning the book: ', v_book_name) AS message;

END $$

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/library_management
0 rows affected.
0 rows affected.

[]

In [21]:
%%sql
SHOW PROCEDURE STATUS WHERE Db = 'library_management';

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[('library_management', 'add_return_records', 'PROCEDURE', 'root@localhost', datetime.datetime(2025, 9, 13, 16, 55, 16), datetime.datetime(2025, 9, 13, 16, 55, 16), 'DEFINER', '', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [49]:
%%sql
#get the issued_id based on book_isbn and assign new return_id and pass this values into the parameter
select * from issued_status
where issued_book_isbn='978-0-06-112008-4'

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[('IS131', 'C106', '978-0-06-112008-4', datetime.date(2024, 4, 4), 'E101', 'To Kill a Mockingbird')]

In [ ]:
%%sql
CALL add_return_records('RS139','IS131');

In [50]:
%%sql
select * from books
limit 5

 * mysql+mysqlconnector://root:***@localhost/library_management
5 rows affected.

[('978-0-06-025492-6', 'Where the Wild Things Are', 'Children', Decimal('3.50'), 'yes', 'Maurice Sendak', 'HarperCollins'),
 ('978-0-06-112008-4', 'To Kill a Mockingbird', 'Classic', Decimal('5.00'), 'yes', 'Harper Lee', 'J.B. Lippincott & Co.'),
 ('978-0-06-112241-5', 'The Kite Runner', 'Fiction', Decimal('5.50'), 'yes', 'Khaled Hosseini', 'Riverhead Books'),
 ('978-0-06-440055-8', "Charlotte's Web", 'Children', Decimal('4.00'), 'yes', 'E.B. White', 'Harper & Row'),
 ('978-0-09-957807-9', 'A Game of Thrones', 'Fantasy', Decimal('7.50'), 'yes', 'George R.R. Martin', 'Bantam')]

**9.Create a query that generates a performance report for each branch, showing the number of books issued, the number of books returned, and the total revenue generated from book rentals.**

In [6]:
%%sql

SELECT 
    b.branch_id,
    b.manager_id,
    COUNT(DISTINCT ist.issued_id) as number_book_issued,
    COUNT(DISTINCT rs.return_id) as number_of_book_return,
    SUM(bk.rental_price) as total_revenue
FROM issued_status as ist
JOIN 
employees as e
ON e.emp_id = ist.issued_emp_id
JOIN
branch as b
ON e.branch_id = b.branch_id
LEFT JOIN
return_status as rs
ON rs.issued_id = ist.issued_id
JOIN 
books as bk
ON ist.issued_book_isbn = bk.isbn
GROUP BY 1, 2;

 * mysql+mysqlconnector://root:***@localhost/library_management
5 rows affected.

[('B001', 'E109', 17, 10, Decimal('111.50')),
 ('B002', 'E109', 1, 0, Decimal('5.50')),
 ('B003', 'E109', 2, 0, Decimal('14.00')),
 ('B004', 'E110', 4, 4, Decimal('26.50')),
 ('B005', 'E110', 8, 2, Decimal('43.00'))]

**10.Create a Query that  containing members who have issued at least one book in the last 18 months.**

In [13]:
%%sql
SELECT * FROM members
WHERE member_id IN (
    select DISTINCT issued_member_id
    from issued_status
    where issued_date>=DATE_SUB(CURRENT_DATE,INTERVAL 18 MONTH)
)

 * mysql+mysqlconnector://root:***@localhost/library_management
10 rows affected.

[('C101', 'Alice Johnson', '123 Main St', '2021-05-15'),
 ('C102', 'Bob Smith', '456 Elm St', '2021-06-20'),
 ('C103', 'Carol Davis', '125 Oak St', '2021-07-10'),
 ('C104', 'Dave Wilson', '567 Pine St', '2021-08-05'),
 ('C105', 'Eve Brown', '890 Maple St', '2021-09-25'),
 ('C106', 'Frank Thomas', '234 Cedar St', '2021-10-15'),
 ('C107', 'Grace Taylor', '345 Walnut St', '2021-11-20'),
 ('C108', 'Henry Anderson', '456 Birch St', '2021-12-10'),
 ('C109', 'Ivy Martinez', '567 Oak St', '2022-01-05'),
 ('C110', 'Jack Wilson', '678 Pine St', '2022-02-25')]

**11.Write a query to find the top 3 employees who have processed the most book issues. Display the employee name, number of books processed, and their branch.**

In [5]:
%%sql

SELECT issued_emp_id as employee_id,e1.emp_name as name,b1.*,count(*) as book_issued
FROM issued_status i1
INNER JOIN employees e1
ON i1.issued_emp_id=e1.emp_id
INNER JOIN branch b1
USING (branch_id)
GROUP BY i1.issued_emp_id
ORDER BY book_issued desc
LIMIT 3

 * mysql+mysqlconnector://root:***@localhost/library_management
3 rows affected.

[('E110', 'Laura Martinez', 'B005', 'E110', '890 Maple St', '+919099988680', 6),
 ('E106', 'Michelle Ramirez', 'B001', 'E109', '123 Main St', '+919099988676', 6),
 ('E104', 'Emily Davis', 'B001', 'E109', '123 Main St', '+919099988676', 4)]

**12.Create a stored procedure to manage the status of books in a library system. Description: Write a stored procedure that updates the status of a book in the library based on its issuance. The procedure should function as follows: The stored procedure should take the book_id as an input parameter. The procedure should first check if the book is available (status = 'yes'). If the book is available, it should be issued, and the status in the books table should be updated to 'no'. If the book is not available (status = 'no'), the procedure should return an error message indicating that the book is currently not available.**

In [7]:
%%sql


CREATE PROCEDURE book_issue(
    IN n_issued_id VARCHAR(6),
    IN n_issued_member_id VARCHAR(6),
    IN n_issued_book_isbn VARCHAR(20),
    IN n_issued_emp_id VARCHAR(6)
)
BEGIN
    DECLARE v_status VARCHAR(20);
    DECLARE v_book_title VARCHAR(80);

    -- Get book status and title
    SELECT status, book_title
    INTO v_status, v_book_title
    FROM books
    WHERE isbn = n_issued_book_isbn
    LIMIT 1;

    -- Check if book is available
    IF v_status = 'yes' THEN
        INSERT INTO issued_status(
            issued_id,
            issued_member_id,
            issued_book_isbn,
            issued_date,
            issued_emp_id,
            issued_book_name
        )
        VALUES(
            n_issued_id,
            n_issued_member_id,
            n_issued_book_isbn,
            CURRENT_DATE,
            n_issued_emp_id,
            v_book_title   
        );

        UPDATE books
        SET status = 'no'
        WHERE isbn = n_issued_book_isbn;

        SELECT CONCAT(v_book_title, ' is successfully issued') AS message;
    ELSE
        SELECT CONCAT(v_book_title, ' is currently unavailable') AS message;
    END IF;
END;

 * mysql+mysqlconnector://root:***@localhost/library_management
0 rows affected.

[]

In [10]:
%%sql
SHOW PROCEDURE STATUS WHERE Db = 'library_management';

 * mysql+mysqlconnector://root:***@localhost/library_management
2 rows affected.

[('library_management', 'add_return_records', 'PROCEDURE', 'root@localhost', datetime.datetime(2025, 9, 13, 16, 55, 16), datetime.datetime(2025, 9, 13, 16, 55, 16), 'DEFINER', '', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('library_management', 'book_issue', 'PROCEDURE', 'root@localhost', datetime.datetime(2025, 9, 15, 12, 28, 41), datetime.datetime(2025, 9, 15, 12, 28, 41), 'DEFINER', '', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [13]:
%%sql

#isbn 978-0-09-957807-9
select * from issued_status
where issued_book_isbn='978-0-09-957807-9'

 * mysql+mysqlconnector://root:***@localhost/library_management
1 rows affected.

[('IS112', 'C109', '978-0-09-957807-9', datetime.date(2024, 3, 16), 'E106', 'A Game of Thrones')]

In [ ]:
%%sql

CALL book_issue('IS141','C111','978-0-09-957807-9','E105')

**13.Description: Write a CTAS query to create a new table that lists each member and the books they have issued but not returned within 30 days. The table should include: The number of overdue books. The total fines, with each day's fine calculated at $0.50. The number of books issued by each member. The resulting table should show: Member ID Number of overdue books Total fines**

In [28]:
%%sql
CREATE TABLE IF NOT EXISTS member_overdue_summary
WITH overdue_books AS (
    SELECT 
        i.issued_member_id,
        DATEDIFF(COALESCE(r.return_date,CURDATE()), i.issued_date) AS no_of_days
    FROM issued_status i
    JOIN books b 
        ON i.issued_book_isbn = b.isbn
    LEFT JOIN return_status r 
        ON i.issued_id = r.issued_id
)
SELECT 
    ob.issued_member_id as member_id,
    m.member_name,
    count(*) as No_of_overdue_books,
    sum(no_of_days) as total_days,
    sum((no_of_days-30)*0.50) as Total_fine
    
FROM overdue_books ob
JOIN members m 
    ON ob.issued_member_id = m.member_id
WHERE no_of_days>30
GROUP BY member_id,m.member_name
ORDER BY member_id

 * mysql+mysqlconnector://root:***@localhost/library_management
10 rows affected.

[]

In [29]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost/library_management
9 rows affected.

[('book_issued_count',),
 ('books',),
 ('branch',),
 ('employees',),
 ('expensive_books',),
 ('issued_status',),
 ('member_overdue_summary',),
 ('members',),
 ('return_status',)]